cases/cfd/fluids/channel_developing_entry/solution/case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Re = 100 is firmly laminar (well below the ~2300 channel transition).
// No RAS/LES model, no k / omega / nut fields.
simulationType  laminar;
